src/toir_cf/src/InformationRegisters/торо_ОчередьУведомлений/торо_ОчередьУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОчередьУведомлений</name>
  <resources>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТелоПисьма</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Пользователи</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ID_уведомления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СпособУведомления</name>
    <type>
      <types>EnumRef.торо_СпособыУведомленияПользователей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DocumentRef.торо_УстановкаЛимитаНаПлановыеРемонтныеРаботы</types>
      <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
      <types>DocumentRef.торо_ИзменениеСоставаРемонтнойБригады</types>
      <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
      <types>DocumentRef.торо_УстановкаКоэффициентовРемонтныхОсобенностей</types>
      <types>DocumentRef.торо_ЗакрытиеЗаявокИРемонтов</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_УстановкаАналоговНоменклатурыДляРемонтов</types>
      <types>DocumentRef.торо_НастройкаРегистрацииНаработкиЗависимыхОР</types>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
      <types>DocumentRef.торо_ИзменениеПоложенияВСтруктуреИерархии</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
      <types>DocumentRef.торо_ПринятиеОРКУчету</types>
      <types>DocumentRef.торо_УстановкаЦелевыхЗначенийПоказателейKPI</types>
      <types>DocumentRef.торо_КомиссионноеРассмотрение</types>
      <types>DocumentRef.торо_РегистрацияЗначенийВнешнихПоказателейKPI</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_ОстановочныеРемонты</types>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
      <types>DocumentRef.торо_ВыбытиеОбъектаРемонта</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ОценкаРаботыПодрядчика</types>
      <types>DocumentRef.торо_УстановкаСтоимостейКвалификаций</types>
      <types>DocumentRef.торо_УчетНаработкиОборудования</types>
      <types>DocumentRef.торо_АнализКоренныхПричин</types>
      <types>DocumentRef.торо_ВводНачальныхДанных</types>
      <types>DocumentRef.торо_ПланРаботПодразделения</types>
      <types>DocumentRef.торо_ПрисвоениеКвалификацийСотрудникам</types>
      <types>DocumentRef.торо_ЗаказПоставщику</types>
      <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      <types>DocumentRef.торо_УстановкаПроизвольногоЗначенияНаработки</types>
      <types>DocumentRef.торо_УстановкаМинимальногоОстаткаНоменклатуры</types>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      <types>DocumentRef.торо_УстановкаКоэффициентовПереводаСтоимостейРемонтов</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      <types>DocumentRef.торо_АктПриемкиОборудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cf/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/InformationRegisters/торо_ОчередьУведомлений/ManagerModule.bsl
#Область ПрограммныйИнтерфейс
// Функция - Получить не отправленные уведомления
// Если значения параметров неопределено (по умолчанию), отбор осуществлен не будет.
//
// Параметры:
//  СпособУведомления - ПеречислениеСсылка.торо_СпособыУведомленияПользователей - Способ уведомления пользователя 
//							по которому будет осуществлен отбор.
//  Пользователь - СправочникСсылка.Пользователи - Пользователь по которому будет осуществлен отбор.
//  МаксимальноеКоличество - Число - ограничение на количество получаемых уведомлений.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Поля:
//		ID_Уведомления,
//		Пользователь,
//		Источник,
//		СпособУведомления,
//		ТемаПисьма,
//		ТелоПисьма,
//		АдресОтправления.
Функция ПолучитьНеОтправленныеУведомления(СпособУведомления = Неопределено,
										  Пользователь = Неопределено, 
										  МаксимальноеКоличество = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100
	               |	торо_ОчередьУведомлений.ID_уведомления КАК ID_уведомления,
	               |	торо_ОчередьУведомлений.Пользователь КАК Пользователь,
	               |	торо_ОчередьУведомлений.Пользователь.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	               |	торо_ОчередьУведомлений.Источник КАК Источник,
	               |	торо_ОчередьУведомлений.СпособУведомления КАК СпособУведомления,
	               |	торо_ОчередьУведомлений.ТемаПисьма КАК ТемаПисьма,
	               |	торо_ОчередьУведомлений.ТелоПисьма КАК ТелоПисьма,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(торо_ОчередьУведомлений.Пользователь) = ТИП(СТРОКА)
	               |			ТОГДА торо_ОчередьУведомлений.Пользователь
	               |		ИНАЧЕ ВложенныйЗапрос.Представление
	               |	КОНЕЦ КАК АдресОтправления
	               |ИЗ
	               |	РегистрСведений.торо_ОчередьУведомлений КАК торо_ОчередьУведомлений
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |			ПользователиКонтактнаяИнформация.Ссылка КАК Ссылка,
	               |			ПользователиКонтактнаяИнформация.Представление КАК Представление
	               |		ИЗ
	               |			Справочник.Пользователи.КонтактнаяИнформация КАК ПользователиКонтактнаяИнформация
	               |		ГДЕ
	               |			ПользователиКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)) КАК ВложенныйЗапрос
	               |		ПО торо_ОчередьУведомлений.Пользователь = ВложенныйЗапрос.Ссылка
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &СпособУведомления = НЕОПРЕДЕЛЕНО
	               |				ТОГДА торо_ОчередьУведомлений.СпособУведомления = &СпособУведомления
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА НЕ &Пользователь = НЕОПРЕДЕЛЕНО
	               |				ТОГДА торо_ОчередьУведомлений.Пользователь = &Пользователь
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
			   
	Запрос.УстановитьПараметр("СпособУведомления", СпособУведомления);
	Запрос.УстановитьПараметр("Пользователь"     , Пользователь);
	
	Если НЕ ЗначениеЗаполнено(МаксимальноеКоличество) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 100", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПЕРВЫЕ 100", "ПЕРВЫЕ "+Формат(МаксимальноеКоличество,"ЧН=0; ЧГ=0"));
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Процедура - Удалить уведомления
//
// Параметры:
//  МассивВыполненныхУведомлений - Массив - Массив выполненных удаляемых уведомлений.
Процедура УдалитьУведомления(МассивВыполненныхУведомлений) Экспорт
	// по аналогии с 1С:Документооборот

	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Уведомление Из МассивВыполненныхУведомлений Цикл
		
		Запись = РегистрыСведений.торо_ОчередьУведомлений.СоздатьМенеджерЗаписи();
		Запись.Пользователь      = Уведомление.Пользователь;
		Запись.ID_уведомления    = Уведомление.ID_уведомления;
		Запись.СпособУведомления = Уведомление.СпособУведомления;
		Запись.Источник          = Уведомление.Источник;
		Запись.Удалить();

	КонецЦикла; 
	
	
КонецПроцедуры

// Процедура - Заполнить описание ошибки
//
// Параметры:
//  МассивНеОтправленныхУведомлений	 - Массив - Массив не отправленных уведомлений.
Процедура ЗаполнитьОписаниеОшибки(МассивНеОтправленныхУведомлений) Экспорт
	// по аналогии с 1С:Документооборот

	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого Уведомление Из МассивНеОтправленныхУведомлений Цикл
		
		Запись = РегистрыСведений.торо_ОчередьУведомлений.СоздатьМенеджерЗаписи();
		Запись.ID_уведомления    = Уведомление.ID_уведомления;
		Запись.Пользователь      = Уведомление.Пользователь;
		Запись.СпособУведомления = Уведомление.СпособУведомления;
		Запись.Источник          = Уведомление.Источник;
		Запись.Прочитать();
		
		Запись.ОписаниеОшибки    = Уведомление.ОписаниеОшибки;
		Запись.Записать(Истина);

	КонецЦикла; 
	
	
КонецПроцедуры
#КонецОбласти
